package com.company;

public class Info {
    public void printInfo(){
        System.out.println("\nВведите 0 для прекращения работы.");
        System.out.println("Введите 1 для того, чтобы установить значение счетчика.");
        System.out.println("Введите 2 для демонстрации цикла счетчика (10-итераций).");
        System.out.println("Введите 3 для демонстрации обратного цикла счетчика (10-итераций).");
        System.out.println("Введите 4 для увелечения счетчика на произвольное число.");
        System.out.println("Введите 5 для уменьшения счетчика на произвольное число.");
        System.out.println("Введите 6 для вывода на консоль значение счетчика.");
    }
}
