package com.epam.training.zaryna;

public class Info {
    public  void printStartInfo(){
        System.out.println("Нажмите 1, чтобы сделать сортировку элементов массива по номерам поездов.\n" +
                "Нажмите 2, чтобы узнать информацию поезда по заданному номеру поездов\n" +
                "Нажмите 3, чтобы сделать сортировку по пунктам назначения(по алфавиту)\n" +
                "Нажмите 4, чтобы сделать сортировку по номерам поезда\n");
    }
    public void printLine(){
        System.out.println("-------------------------------------------------------------------------------------------------");
    }
}
