package com.company.com.epam.bsu;

public class Info {
    public void printInfo() {

        System.out.println("Нажмите 1, чтобы отсортровать счета по балансу \n" +
                "Нажмите 2, чтобы вывести информацию по заданному имени \n" +
                "Нажмите 3, чтобы отсортировать имена клиентов по алфавиту, если имена совпадают, то сортируется по балансу \n" +
                "Нажмите 4, чтобы заблокировать счет по индексу[0-9] \n" +
                "Нажмите 5, чтобы  разблокировать счет по индексу\n" +
                "Нажмите 6, чтобы сделать депозит на счет о индексу[0-9]\n" +
                "Нажмите 7, чтобы снять деньги со счета с индексом[0-9] \n" +
                "Нажмите 8, чтобы создать новый банковский счет \n" +
                "Нажмите 9, чтобы удалить счет по названиию клиента\n" +
                "Нажмите 10, чтобы сделать поиск по балансу\n" +
                "Нажмите 11, чтобы вывести положительный баланс всех счетов\n" +
                "Нажмите 12, чтобы вывести отрицательный баланс всех счетов\n" +
                "Нажмите 13, чтобы найти общий баланс\n" +
                "Нажмите 14, чтобы заблакировать все счета\n" +
                "Нажмите 15, чтобы разблакировать все счета\n" +
                "Нажмите 16, чтобы заблакировать счет по имени и балансу\n" +
                "Нажмите 17, чтобы вывести информацию о счетах \n");
    }

}
