package com.company.com.company.epam.training;

public class Info {
    public void printInfo(){
        System.out.println("\nВведите 0 для прекращения работы.\nВведите 1 для того, чтобы установить время при помощи строки.\n" +
                "Введите 2, чтобы установить часы.\nВведите 3, чтобы установить минуты\nВведите 4, чтобы установить секунды\n" +
                "Введите 5, чтобы прибавить часы.\nВведите 6, чтобы прибавить минуты.\nВведите 7, чтобы прибавить секунды\nВведите 8, чтобы вывести время\n");

    }
}
